###############################################################################
# Created by write_sdc
# Tue May 21 06:05:06 2024
###############################################################################
current_design mem_decode
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.1500 clk
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_5}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_6}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_7}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_rdata[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_ready}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_instr}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_valid}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wdata[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wstrb[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wstrb[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wstrb[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_wstrb[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ram_rdata[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_do[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_wait}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_do[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_rdata[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimem_ready}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_do[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_irq_out[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_picosoc_mem_wen[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_picosoc_mem_wen[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_picosoc_mem_wen[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_picosoc_mem_wen[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_simpleuart_reg_dat_re}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_simpleuart_reg_dat_we}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_simpleuart_reg_div_we[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_simpleuart_reg_div_we[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_simpleuart_reg_div_we[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_simpleuart_reg_div_we[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_spimemio_cfgreg_we[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_spimemio_cfgreg_we[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_spimemio_cfgreg_we[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_spimemio_cfgreg_we[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {extra_spimemio_valid}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_addr[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_valid}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wdata[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wstrb[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wstrb[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wstrb[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {iomem_wstrb[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_ready}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_dat_sel}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {simpleuart_reg_div_sel}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {spimemio_cfgreg_sel}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {extra_simpleuart_reg_dat_re}]
set_load -pin_load 0.0334 [get_ports {extra_simpleuart_reg_dat_we}]
set_load -pin_load 0.0334 [get_ports {extra_spimemio_valid}]
set_load -pin_load 0.0334 [get_ports {iomem_valid}]
set_load -pin_load 0.0334 [get_ports {mem_ready}]
set_load -pin_load 0.0334 [get_ports {simpleuart_reg_dat_sel}]
set_load -pin_load 0.0334 [get_ports {simpleuart_reg_div_sel}]
set_load -pin_load 0.0334 [get_ports {spimemio_cfgreg_sel}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[31]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[30]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[29]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[28]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[27]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[26]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[25]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[24]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[23]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[22]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[21]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[20]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[19]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[18]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[17]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[16]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[15]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[14]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[13]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[12]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[11]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[10]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[9]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[8]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[7]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[6]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[5]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[4]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[3]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[2]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[1]}]
set_load -pin_load 0.0334 [get_ports {extra_irq_out[0]}]
set_load -pin_load 0.0334 [get_ports {extra_picosoc_mem_wen[3]}]
set_load -pin_load 0.0334 [get_ports {extra_picosoc_mem_wen[2]}]
set_load -pin_load 0.0334 [get_ports {extra_picosoc_mem_wen[1]}]
set_load -pin_load 0.0334 [get_ports {extra_picosoc_mem_wen[0]}]
set_load -pin_load 0.0334 [get_ports {extra_simpleuart_reg_div_we[3]}]
set_load -pin_load 0.0334 [get_ports {extra_simpleuart_reg_div_we[2]}]
set_load -pin_load 0.0334 [get_ports {extra_simpleuart_reg_div_we[1]}]
set_load -pin_load 0.0334 [get_ports {extra_simpleuart_reg_div_we[0]}]
set_load -pin_load 0.0334 [get_ports {extra_spimemio_cfgreg_we[3]}]
set_load -pin_load 0.0334 [get_ports {extra_spimemio_cfgreg_we[2]}]
set_load -pin_load 0.0334 [get_ports {extra_spimemio_cfgreg_we[1]}]
set_load -pin_load 0.0334 [get_ports {extra_spimemio_cfgreg_we[0]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[31]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[30]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[29]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[28]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[27]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[26]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[25]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[24]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[23]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[22]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[21]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[20]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[19]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[18]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[17]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[16]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[15]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[14]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[13]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[12]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[11]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[10]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[9]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[8]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[7]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[6]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[5]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[4]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[3]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[2]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[1]}]
set_load -pin_load 0.0334 [get_ports {iomem_addr[0]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[31]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[30]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[29]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[28]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[27]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[26]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[25]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[24]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[23]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[22]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[21]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[20]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[19]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[18]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[17]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[16]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[15]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[14]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[13]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[12]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[11]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[10]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[9]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[8]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[7]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[6]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[5]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[4]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[3]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[2]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[1]}]
set_load -pin_load 0.0334 [get_ports {iomem_wdata[0]}]
set_load -pin_load 0.0334 [get_ports {iomem_wstrb[3]}]
set_load -pin_load 0.0334 [get_ports {iomem_wstrb[2]}]
set_load -pin_load 0.0334 [get_ports {iomem_wstrb[1]}]
set_load -pin_load 0.0334 [get_ports {iomem_wstrb[0]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[31]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[30]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[29]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[28]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[27]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[26]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[25]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[24]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[23]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[22]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[21]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[20]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[19]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[18]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[17]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[16]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[15]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[14]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[13]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[12]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[11]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[10]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[9]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[8]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[7]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[6]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[5]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[4]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[3]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[2]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[1]}]
set_load -pin_load 0.0334 [get_ports {mem_rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {extra_irq_5}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {extra_irq_6}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {extra_irq_7}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_instr}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_wait}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iomem_rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wstrb[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wstrb[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wstrb[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_wstrb[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_dat_do[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {simpleuart_reg_div_do[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimem_rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spimemio_cfgreg_do[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
