###############################################################################
# Created by write_sdc
# Thu May 30 17:45:58 2024
###############################################################################
current_design core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruc_mem_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_data_in[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_address[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_request}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_mem_we_re}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruc_mask_singal[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruc_mask_singal[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruc_mask_singal[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruc_mask_singal[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_mem_request}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_mem_we_re}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_signal}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mask_singal[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mask_singal[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mask_singal[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mask_singal[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_address[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {store_data_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {data_mem_request}]
set_load -pin_load 0.0334 [get_ports {data_mem_we_re}]
set_load -pin_load 0.0334 [get_ports {instruction_mem_request}]
set_load -pin_load 0.0334 [get_ports {instruction_mem_we_re}]
set_load -pin_load 0.0334 [get_ports {load_signal}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[31]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[30]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[29]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[28]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[27]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[26]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[25]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[24]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[23]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[22]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[21]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[20]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[19]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[18]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[17]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[16]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[15]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[14]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[13]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[12]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[11]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[10]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[9]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[8]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[7]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[6]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[5]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[4]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[3]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[2]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[1]}]
set_load -pin_load 0.0334 [get_ports {alu_out_address[0]}]
set_load -pin_load 0.0334 [get_ports {data_out[31]}]
set_load -pin_load 0.0334 [get_ports {data_out[30]}]
set_load -pin_load 0.0334 [get_ports {data_out[29]}]
set_load -pin_load 0.0334 [get_ports {data_out[28]}]
set_load -pin_load 0.0334 [get_ports {data_out[27]}]
set_load -pin_load 0.0334 [get_ports {data_out[26]}]
set_load -pin_load 0.0334 [get_ports {data_out[25]}]
set_load -pin_load 0.0334 [get_ports {data_out[24]}]
set_load -pin_load 0.0334 [get_ports {data_out[23]}]
set_load -pin_load 0.0334 [get_ports {data_out[22]}]
set_load -pin_load 0.0334 [get_ports {data_out[21]}]
set_load -pin_load 0.0334 [get_ports {data_out[20]}]
set_load -pin_load 0.0334 [get_ports {data_out[19]}]
set_load -pin_load 0.0334 [get_ports {data_out[18]}]
set_load -pin_load 0.0334 [get_ports {data_out[17]}]
set_load -pin_load 0.0334 [get_ports {data_out[16]}]
set_load -pin_load 0.0334 [get_ports {data_out[15]}]
set_load -pin_load 0.0334 [get_ports {data_out[14]}]
set_load -pin_load 0.0334 [get_ports {data_out[13]}]
set_load -pin_load 0.0334 [get_ports {data_out[12]}]
set_load -pin_load 0.0334 [get_ports {data_out[11]}]
set_load -pin_load 0.0334 [get_ports {data_out[10]}]
set_load -pin_load 0.0334 [get_ports {data_out[9]}]
set_load -pin_load 0.0334 [get_ports {data_out[8]}]
set_load -pin_load 0.0334 [get_ports {data_out[7]}]
set_load -pin_load 0.0334 [get_ports {data_out[6]}]
set_load -pin_load 0.0334 [get_ports {data_out[5]}]
set_load -pin_load 0.0334 [get_ports {data_out[4]}]
set_load -pin_load 0.0334 [get_ports {data_out[3]}]
set_load -pin_load 0.0334 [get_ports {data_out[2]}]
set_load -pin_load 0.0334 [get_ports {data_out[1]}]
set_load -pin_load 0.0334 [get_ports {data_out[0]}]
set_load -pin_load 0.0334 [get_ports {instruc_mask_singal[3]}]
set_load -pin_load 0.0334 [get_ports {instruc_mask_singal[2]}]
set_load -pin_load 0.0334 [get_ports {instruc_mask_singal[1]}]
set_load -pin_load 0.0334 [get_ports {instruc_mask_singal[0]}]
set_load -pin_load 0.0334 [get_ports {mask_singal[3]}]
set_load -pin_load 0.0334 [get_ports {mask_singal[2]}]
set_load -pin_load 0.0334 [get_ports {mask_singal[1]}]
set_load -pin_load 0.0334 [get_ports {mask_singal[0]}]
set_load -pin_load 0.0334 [get_ports {pc_address[31]}]
set_load -pin_load 0.0334 [get_ports {pc_address[30]}]
set_load -pin_load 0.0334 [get_ports {pc_address[29]}]
set_load -pin_load 0.0334 [get_ports {pc_address[28]}]
set_load -pin_load 0.0334 [get_ports {pc_address[27]}]
set_load -pin_load 0.0334 [get_ports {pc_address[26]}]
set_load -pin_load 0.0334 [get_ports {pc_address[25]}]
set_load -pin_load 0.0334 [get_ports {pc_address[24]}]
set_load -pin_load 0.0334 [get_ports {pc_address[23]}]
set_load -pin_load 0.0334 [get_ports {pc_address[22]}]
set_load -pin_load 0.0334 [get_ports {pc_address[21]}]
set_load -pin_load 0.0334 [get_ports {pc_address[20]}]
set_load -pin_load 0.0334 [get_ports {pc_address[19]}]
set_load -pin_load 0.0334 [get_ports {pc_address[18]}]
set_load -pin_load 0.0334 [get_ports {pc_address[17]}]
set_load -pin_load 0.0334 [get_ports {pc_address[16]}]
set_load -pin_load 0.0334 [get_ports {pc_address[15]}]
set_load -pin_load 0.0334 [get_ports {pc_address[14]}]
set_load -pin_load 0.0334 [get_ports {pc_address[13]}]
set_load -pin_load 0.0334 [get_ports {pc_address[12]}]
set_load -pin_load 0.0334 [get_ports {pc_address[11]}]
set_load -pin_load 0.0334 [get_ports {pc_address[10]}]
set_load -pin_load 0.0334 [get_ports {pc_address[9]}]
set_load -pin_load 0.0334 [get_ports {pc_address[8]}]
set_load -pin_load 0.0334 [get_ports {pc_address[7]}]
set_load -pin_load 0.0334 [get_ports {pc_address[6]}]
set_load -pin_load 0.0334 [get_ports {pc_address[5]}]
set_load -pin_load 0.0334 [get_ports {pc_address[4]}]
set_load -pin_load 0.0334 [get_ports {pc_address[3]}]
set_load -pin_load 0.0334 [get_ports {pc_address[2]}]
set_load -pin_load 0.0334 [get_ports {pc_address[1]}]
set_load -pin_load 0.0334 [get_ports {pc_address[0]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[31]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[30]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[29]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[28]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[27]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[26]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[25]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[24]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[23]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[22]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[21]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[20]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[19]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[18]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[17]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[16]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[15]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[14]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[13]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[12]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[11]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[10]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[9]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[8]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[7]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[6]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[5]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[4]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[3]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[2]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[1]}]
set_load -pin_load 0.0334 [get_ports {store_data_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_mem_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruc_mem_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_data_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
